# Baby name Database part2

In [1]:
import pandas as pd

In [2]:
pd.read_csv("AK.TXT")

       AK  F  1910      Mary  14
0      AK  F  1910     Annie  12
1      AK  F  1910      Anna  10
2      AK  F  1910  Margaret   8
3      AK  F  1910     Helen   7
4      AK  F  1910     Elsie   6
...    .. ..   ...       ...  ..
28522  AK  M  2018      Theo   5
28523  AK  M  2018    Thorin   5
28524  AK  M  2018   Trenton   5
28525  AK  M  2018    Victor   5
28526  AK  M  2018      Zion   5

[28527 rows x 5 columns]

In [3]:
pd.read_csv("AK.TXT", header = None, names = ["State","Gender","Year","Name","Count"])

      State Gender  Year      Name  Count
0        AK      F  1910      Mary     14
1        AK      F  1910     Annie     12
2        AK      F  1910      Anna     10
3        AK      F  1910  Margaret      8
4        AK      F  1910     Helen      7
...     ...    ...   ...       ...    ...
28523    AK      M  2018      Theo      5
28524    AK      M  2018    Thorin      5
28525    AK      M  2018   Trenton      5
28526    AK      M  2018    Victor      5
28527    AK      M  2018      Zion      5

[28528 rows x 5 columns]

## The Glob Module

In [5]:
from glob import glob

In [6]:
glob("A?.TXT")

['AK.TXT', 'AL.TXT', 'AR.TXT', 'AZ.TXT']

In [8]:
glob("*.TXT")

['AK.TXT',
 'AL.TXT',
 'AR.TXT',
 'AZ.TXT',
 'CA.TXT',
 'CO.TXT',
 'CT.TXT',
 'DC.TXT',
 'DE.TXT',
 'FL.TXT',
 'GA.TXT',
 'HI.TXT',
 'IA.TXT',
 'ID.TXT',
 'IL.TXT',
 'IN.TXT',
 'KS.TXT',
 'KY.TXT',
 'LA.TXT',
 'MA.TXT',
 'MD.TXT',
 'ME.TXT',
 'MI.TXT',
 'MN.TXT',
 'MO.TXT',
 'MS.TXT',
 'MT.TXT',
 'NC.TXT',
 'ND.TXT',
 'NE.TXT',
 'NH.TXT',
 'NJ.TXT',
 'NM.TXT',
 'NV.TXT',
 'NY.TXT',
 'OH.TXT',
 'OK.TXT',
 'OR.TXT',
 'PA.TXT',
 'RI.TXT',
 'SC.TXT',
 'SD.TXT',
 'TN.TXT',
 'TX.TXT',
 'UT.TXT',
 'VA.TXT',
 'VT.TXT',
 'WA.TXT',
 'WI.TXT',
 'WV.TXT',
 'WY.TXT']

In [9]:
glob("subdir\\*.TXT")

['subdir\\yob1880.txt', 'subdir\\yob1881.txt']

In [10]:
filenames = glob("*.TXT")

In [11]:
filenames

['AK.TXT',
 'AL.TXT',
 'AR.TXT',
 'AZ.TXT',
 'CA.TXT',
 'CO.TXT',
 'CT.TXT',
 'DC.TXT',
 'DE.TXT',
 'FL.TXT',
 'GA.TXT',
 'HI.TXT',
 'IA.TXT',
 'ID.TXT',
 'IL.TXT',
 'IN.TXT',
 'KS.TXT',
 'KY.TXT',
 'LA.TXT',
 'MA.TXT',
 'MD.TXT',
 'ME.TXT',
 'MI.TXT',
 'MN.TXT',
 'MO.TXT',
 'MS.TXT',
 'MT.TXT',
 'NC.TXT',
 'ND.TXT',
 'NE.TXT',
 'NH.TXT',
 'NJ.TXT',
 'NM.TXT',
 'NV.TXT',
 'NY.TXT',
 'OH.TXT',
 'OK.TXT',
 'OR.TXT',
 'PA.TXT',
 'RI.TXT',
 'SC.TXT',
 'SD.TXT',
 'TN.TXT',
 'TX.TXT',
 'UT.TXT',
 'VA.TXT',
 'VT.TXT',
 'WA.TXT',
 'WI.TXT',
 'WV.TXT',
 'WY.TXT']

In [12]:
len(filenames)

51

In [13]:
dataframe =[]
for name in filenames:
    df= pd.read_csv(name, header = None, names = ["State","Gender","Year","Name","Count"])
    dataframe.append(df)

In [14]:
df

      State Gender  Year      Name  Count
0        WY      F  1910      Mary     27
1        WY      F  1910  Margaret     22
2        WY      F  1910     Helen     13
3        WY      F  1910     Alice     10
4        WY      F  1910   Dorothy      9
...     ...    ...   ...       ...    ...
28015    WY      M  2018    Peyton      5
28016    WY      M  2018   Richard      5
28017    WY      M  2018     Titus      5
28018    WY      M  2018   Tristan      5
28019    WY      M  2018    Zander      5

[28020 rows x 5 columns]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28020 entries, 0 to 28019
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   28020 non-null  object
 1   Gender  28020 non-null  object
 2   Year    28020 non-null  int64
 3   Name    28020 non-null  object
 4   Count   28020 non-null  int64
dtypes: int64(2), object(3)
memory usage: 1.1+ MB

In [16]:
df.to_csv('database_complete.csv', index = False)